In [ ]:
# Nested Loops For .. else 

['Even' if n%2==0 else 'odd' for n in range(1,10)]

In [21]:
import pandas as pd 
df = pd.read_csv("Employees.csv")
#df.select_dtypes(include='number').aggregate(['sum','min'])
gk = df.groupby("dept_code") 
gk.first()

           empid empname         doj  salary      mobile
dept_code
IT          1002  Joseph  02-01-2001  400000  9333344446
MKT         1001    Raju  01-01-2001  250000  9333344446
SALES       1003  Keethi  03-01-2001  400000  9333344446

In [12]:
# Saving data frame to a CSV

id = [1,2,3]
name = ["Ravi","Krishna","Sangeetha"]
age = [10,11,12]

# dictionary of lists
dict = {'id':id, 'name':name,'age':age}

df=pd.DataFrame(dict)

#Export DF to a CSV
df.to_csv("student_exp.csv")